20230912110747-peer_review_fast.org
:PROPERTIES:
:ID:       37464520-e48f-4ab9-96eb-520503adcf57
:END:
#+title: Peer review (FAST)

* Peer Reviews: Qualities of strong feedback (F.A.S.T.)
The framework outlined below is a great guide on how to provide constructive feedback for peer review assignments on Coursera.

=F.A.S.T= Feedback
Strong feedback has 4 characteristics:

A Note About Tone: Begin your feedback with at least one positive comment. Be respectful and constructive by starting out with positive feedback before giving your critical feedback.

** (F)eed-forward:
Tells learners how your feedback will help them succeed in future assignments or reach their goals related to what is coming up in class.
Focused on goals and the future. That’s why it’s important to give learners a forward reference point.

| Feed-forward feedback Examples                                                              | Not Feed-Forward Feedback Examples   |
|---------------------------------------------------------------------------------------------+--------------------------------------|
| Implementing this feedback will help you do better on the next peer review assignment.      | Think about this feedback carefully. |
| Making these changes will help you code faster, so you will be a more efficient programmer. | You should make these changes.       |

** (A)ctionable:
Feedback should be specific, useful, and provide actionable information. For example, saying “good job!” or “you didn’t follow the instructions” are not actionable or useful. What specifically should the learner do more or less of next time? It might help to cite specific content from the learner’s submission.

| Actionable Feedback Examples                                                                                                                                       | Not Actionable Feedback Examples                 |
|--------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------|
| I like how you answered the question in two paragraphs, as the instructions asked for. One way to improve it can be.                                               | Good job!                                        |
| Please limit your answer to 2 paragraphs of 5-8 sentences each.                                                                                                    | This is too long.                                |
| Your charts convey all the required information. It can be made more readable by changing the axis limits.                                                         | Your chart isn't very clear.                     |
| You commented on the business’ financial position but did not include supporting data. Include specific profitability and liquidity data to support your argument. | Your argument isn’t strong. It’s not very clear. |

** (S)uccinct:
Pick 2-3 key pieces of feedback that learners should focus on. Change based on this feedback should make a significant, positive difference in their next draft.

** (T)imely:
The sooner the feedback, the better. Feedback should ideally be given within one day and no longer than 2 days after submission.
| Timely Feedback Example    | Somewhat Timely Feedback Example | Not Timely Feedback Example |
|----------------------------+----------------------------------+-----------------------------|
| Within 1 day of submission | 1-2 days after submission        | A week after submission     |
