20230912110747-peer_review_fast.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Peer review (FAST)</title>
<meta name="author" content="Mikey" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Peer review (FAST)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org702e095">1. Peer Reviews: Qualities of strong feedback (F.A.S.T.)</a>
<ul>
<li><a href="#org5791c6d">1.1. (F)eed-forward:</a></li>
<li><a href="#orgc44eaf0">1.2. (A)ctionable:</a></li>
<li><a href="#org4019744">1.3. (S)uccinct:</a></li>
<li><a href="#org796d23a">1.4. (T)imely:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org702e095" class="outline-2">
<h2 id="org702e095"><span class="section-number-2">1.</span> Peer Reviews: Qualities of strong feedback (F.A.S.T.)</h2>
<div class="outline-text-2" id="text-1">
<p>
The framework outlined below is a great guide on how to provide constructive feedback for peer review assignments on Coursera.
</p>

<p>
<code>F.A.S.T</code> Feedback
Strong feedback has 4 characteristics:
</p>

<p>
A Note About Tone: Begin your feedback with at least one positive comment. Be respectful and constructive by starting out with positive feedback before giving your critical feedback.
</p>
</div>
<div id="outline-container-org5791c6d" class="outline-3">
<h3 id="org5791c6d"><span class="section-number-3">1.1.</span> (F)eed-forward:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Tells learners how your feedback will help them succeed in future assignments or reach their goals related to what is coming up in class.
Focused on goals and the future. That’s why it’s important to give learners a forward reference point.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feed-forward feedback Examples</th>
<th scope="col" class="org-left">Not Feed-Forward Feedback Examples</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Implementing this feedback will help you do better on the next peer review assignment.</td>
<td class="org-left">Think about this feedback carefully.</td>
</tr>

<tr>
<td class="org-left">Making these changes will help you code faster, so you will be a more efficient programmer.</td>
<td class="org-left">You should make these changes.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc44eaf0" class="outline-3">
<h3 id="orgc44eaf0"><span class="section-number-3">1.2.</span> (A)ctionable:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Feedback should be specific, useful, and provide actionable information. For example, saying “good job!” or “you didn’t follow the instructions” are not actionable or useful. What specifically should the learner do more or less of next time? It might help to cite specific content from the learner’s submission.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Actionable Feedback Examples</th>
<th scope="col" class="org-left">Not Actionable Feedback Examples</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">I like how you answered the question in two paragraphs, as the instructions asked for. One way to improve it can be.</td>
<td class="org-left">Good job!</td>
</tr>

<tr>
<td class="org-left">Please limit your answer to 2 paragraphs of 5-8 sentences each.</td>
<td class="org-left">This is too long.</td>
</tr>

<tr>
<td class="org-left">Your charts convey all the required information. It can be made more readable by changing the axis limits.</td>
<td class="org-left">Your chart isn't very clear.</td>
</tr>

<tr>
<td class="org-left">You commented on the business’ financial position but did not include supporting data. Include specific profitability and liquidity data to support your argument.</td>
<td class="org-left">Your argument isn’t strong. It’s not very clear.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4019744" class="outline-3">
<h3 id="org4019744"><span class="section-number-3">1.3.</span> (S)uccinct:</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Pick 2-3 key pieces of feedback that learners should focus on. Change based on this feedback should make a significant, positive difference in their next draft.
</p>
</div>
</div>
<div id="outline-container-org796d23a" class="outline-3">
<h3 id="org796d23a"><span class="section-number-3">1.4.</span> (T)imely:</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The sooner the feedback, the better. Feedback should ideally be given within one day and no longer than 2 days after submission.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Timely Feedback Example</th>
<th scope="col" class="org-left">Somewhat Timely Feedback Example</th>
<th scope="col" class="org-left">Not Timely Feedback Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Within 1 day of submission</td>
<td class="org-left">1-2 days after submission</td>
<td class="org-left">A week after submission</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
